import React from 'react';

import './agreement.scss';

export default function Agreement(props) {
    return (
        <div className='sm-agreement'>
            <p>商米账号基于互联网提供的相关服务（以下简称“本服务”）是由上海商米科技有限公司（以下简称“本公司”）向用户提供的产品与服务。本条款由您和本公司签订。</p>
            <h2>一、总则</h2>
            <ol>
                <li>您确认：您在使用本服务之前，请您充分阅读、理解并接受本协议的全部内容，一旦您选择“同意”并完成注册、开启流程或使用本服务，即表示您同意遵循本协议之所有约定。</li>
                <li>您同意：本公司有权随时对本协议及相应的服务规则、服务内容、产品说明、产品功能等进行单方面的变更，并以消息推送、网页公告、短信群发等一种或多种方式予以公布，无需另行单独通知您，此种变更或调整不视为本公司违反本协议约定；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将按照修改后的协议内容使用本服务；若您不同意修改后的协议内容，您应立即停止使用本服务。</li>
                <li>您认可：本协议受中华人民共和国现行及不时更新的法律、法规之约束。本公司提供的服务内容和要求不受您所属国家或地区法律的排斥。如本协议约定与您所属国家、地区的法律法规相抵触，双方认可以中华人民共和国法律法规为唯一准据法。</li>
                <li>您声明：在您同意接受本协议并注册成为商米平台用户时，您具有法律规定的完全民事权利能力和民事行为能力，并能够独立承担民事责任的自然人、法人或其他组织，或已经取得了充分的授权。不具备前述条件的，您应立即终止注册或停止使用本服务。</li>
                <li>您承诺：针对本协议项下相关产品、服务的使用行为，除应符合相关法律法规的规定外，还应符合社会公共道德的要求，不应损害任意第三方的合法权益，如因此遇到第三方追偿或权利主张，您应当承担全部责任，并确保本公司及其相关股东、董事会成员、各级管理成员等不受到牵连或因此而承担任何责任。对于任何第三方的损失，本公司不承担任何关联赔偿或作出任何承诺。</li>
            </ol>
            <h2>二、账户</h2>
            <ol>
                <li>
                    <h3>注册</h3>
                    <p>在使用本服务前，您必须先行注册，取得本公司提供给您的本公司账户（以下简称“该账户”），您同意并保证：</p>
                    <ol>
                        <li>(1)在完成注册或激活流程时，您应当按照法律法规要求，按相应页面的提示准确提供并及时更新您的资料，以使之真实、及时，完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，本公司有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理、暂停注册、暂停帐户使用直至中止、终止对您提供的部分或全部服务。本公司对因此而造成的服务暂停、中止或终止不承担任何责任，您将自行承担因此产生的任何不利后果。</li>
                        <li>(2)您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便本公司与您进行有效联系；因通过这些联系方式无法与您取得联系，导致您在使用本服务过程中产生任何损失或增加费用的，应由您完全独自承担。您了解并同意，您有义务保持您提供的联系方式的有效性，如有变更需要更新的，您应按本公司的要求进行操作。</li>
                    </ol>
                </li>
                <li>
                    <h3>账户安全</h3>
                    <p>您将对使用该账户及密码进行的一切操作及发表的言论负完全的责任，您同意：</p>
                    <ol>
                        <li>(1)对于本公司提供的该账户，您仅享有使用权；您应对您的本公司账户负责，只有您本人可以使用您的本公司账户；如您对该账户的使用权进行转让、赠与或授权他人使用的，应书面告知本公司，经本公司同意且上述承继人完成签署本协议后，承继人才能合法取得该账户的使用权，否则，本公司有权随时中止或终止对您提供的全部服务且不承担任何责任。</li>
                        <li>(2)本公司通过您的用户名和密码识别您的指示，请您妥善保管您的用户名和密码，对于因密码泄露所致的损失及因此而引起的一切不利后果，由您自行承担。您保证不向其他任何人泄露该账户及密码，亦不使用其他任何人的本公司账户及密码。</li>
                        <li>(3)如您发现有他人冒用或盗用您的账户及密码或任何其他未经合法授权之情形时，应立即以有效方式通知本公司，要求本公司暂停相关服务。同时，您理解本公司对您的请求采取行动需要合理期限，在此之前，本公司对已执行的指令及(或)所导致的您的损失不承担任何责任。</li>
                        <li>(4)如您遗忘帐户名称或相关密码，应及时与本公司联系，按照平台网站的提示取回密码并及时进行密码重置。</li>
                    </ol>
                </li>
                <li>
                    <h3>账户注销</h3>
                    <p>本公司保留在您违反国家、地方法律法规规定或违反本服务条款的情况下对您的帐户进行注销，保留中止或终止为您提供服务的权利。</p>
                    <ol>
                        <li>(1)对于本公司提供的该账户，您仅享有使用权；您应对您的本公司账户负责，只有您本人可以使用您的本公司账户；如您对该账户的使用权进行转让、赠与或授权他人使用的，应书面告知本公司，经本公司同意且上述承继人完成签署本协议后，承继人才能合法取得该账户的使用权，否则，本公司有权随时中止或终止对您提供的全部服务且不承担任何责任。</li>
                        <li>(2)本公司通过您的用户名和密码识别您的指示，请您妥善保管您的用户名和密码，对于因密码泄露所致的损失及因此而引起的一切不利后果，由您自行承担。您保证不向其他任何人泄露该账户及密码，亦不使用其他任何人的本公司账户及密码。</li>
                        <li>(3)如您发现有他人冒用或盗用您的账户及密码或任何其他未经合法授权之情形时，应立即以有效方式通知本公司，要求本公司暂停相关服务。同时，您理解本公司对您的请求采取行动需要合理期限，在此之前，本公司对已执行的指令及(或)所导致的您的损失不承担任何责任。</li>
                        <li>(4)如您遗忘帐户名称或相关密码，应及时与本公司联系，按照平台网站的提示取回密码并及时进行密码重置。</li>
                    </ol>
                </li>
            </ol>
            <h2>三、本公司服务使用守则</h2>
            <p>为有效保障您使用本服务的合法权益，您理解并同意接受以下规则：</p>
            <ol>
                <li>您在使用本服务过程中，本协议内容、页面上出现的关于交易操作的提示或本公司发送到您手机的信息（短信或电话等）内容是您使用本服务的相关规则，您使用本服务即表示您同意接受本服务的相关规则。您了解并同意本公司有权单方修改服务的相关规则，而无须征得您的同意，服务规则应以您使用服务时的页面提示（包括但不限于短信群发、电话告知、网站公告等）为准，您同意并遵照服务规则是您使用本服务的前提。</li>
                <li>本公司可能会以电子邮件（包括但不限于短信群发、电话告知、网站公告等）方式通知您服务进展情况以及提示您进行下一步的操作，但本公司不保证您能够收到或者及时收到该邮件（包括但不限于短信群发、电话告知、网站公告等），且不对此承担任何后果。因此，在服务过程中您应当及时登录到本网站查看和进行交易操作。因您没有及时查看和对服务状态进行修改或确认或未能提交相关申请而导致的任何纠纷或损失，本公司不承担任何责任。</li>
                <li>在您使用本服务时，本公司有权依照相应的服务收费报价单、订单及/或相关协议向您收取服务费用。本公司拥有制订及调整服务费之权利，具体服务费用以您使用本服务时平台网站页面上所列之收费方式为准，或以您与本公司达成的其他书面协议为准。</li>
            </ol>
            <h2>四、您的权利和义务</h2>
            <ol>
                <li>您有权利享受本公司提供的互联网技术和信息服务，并有权利在接受本公司提供的服务时获得本公司的技术支持、咨询等服务，服务内容及服务产品的价格信息详见平台网站相关介绍。</li>
                <li>您承诺，您完全具有履行本合同所必须的法律法规要求的所有资质，由于您缺少相应资质导致的全部法律责任和不利后果，您应自行承担，同时本公司有权暂停或终止为您提供服务。</li>
                <li>您知悉：您应按照《信息网络传播权保护条例》、《互联网著作权行政保护办法》等法律法规的要求对上网用户的相关信息进行记录，记录备份应依法保存90天，并在国家机关依法查询时予以提供。</li>
                <li>您应尊重本公司及其他第三方的知识产权和其他合法权利，并保证在发生侵犯上述权益的违法事件时尽力保护本公司及其股东、雇员、合作伙伴等免于因该等事件受到影响或损失；本公司保留您侵犯本公司合法权益时终止向您提供服务并不退还任何款项的权利。如因您的违法或侵权行为造成本公司或本公司其他客户的损失的，您应承担全部责任。</li>
                <li>您确认向本公司提供的联络方式是正确的，若因为联络方式有误或者您用于接受本公司邮件的电子邮箱安全性、稳定性不佳而导致的一切后果，您应自行承担责任，包括但不限于因您未能及时收到本公司的相关通知而导致的后果和损失。</li>
                <li>您认同使用本公司提供的服务费用计费及数据查询系统，您对计费及数据的疑议不应成为您停止或暂停其履约或支付义务的理由。您应按时支付服务费用，并有权从本公司获取服务费用发票。</li>
                <li>您有权对本协议中的涉及产品、服务、价格等提出询问。一旦您选择使用这些产品、服务，我们将认为您已经不存在任何疑问，且您已经承诺放弃因疑问而向本公司进行追偿。</li>
                <li>您知悉，您可以采用信用卡或者账户预充值的方式进行产品使用费用的支付，若您采用账户预充值的方式进行支付，您的账户余额不能和本平台其他不同的账户进行转让、赠与等操作，也不能进行转为现金、提现等操作。</li>
                <li>
                    <span>您保证您使用本服务时将遵从国家、地方法律法规、行业惯例和社会公共道德，不会利用本公司提供的服务进行存储、发布、传播如下信息和内容：</span>
                    <ol>
                        <li>(1) 反对宪法所确定的基本原则的；</li>
                        <li>(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</li>
                        <li>(3) 损害国家荣誉和利益的；</li>
                        <li>(4) 煽动民族仇恨、民族歧视，破坏民族团结的；</li>
                        <li>(5) 破坏国家宗教政策，宣扬邪教和封建迷信的；</li>
                        <li>(6) 散布谣言，扰乱社会秩序，破坏社会稳定的；</li>
                        <li>(7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</li>
                        <li>(8) 侮辱或者诽谤他人，侵害他人合法权益的；</li>
                    </ol>
                    <p>您同时承诺不利用本公司提供的服务实施危害电信网络安全和信息安全的行为，或实施扰乱电信市场秩序的行为危害电信网络安全和信息安全的行为，或实施扰乱电信市场秩序的行为；您知悉并认可基于互联网的特殊性，在您的帐户及应用危害到其他第三方合法权益和利益时，本公司有权停止您帐户的使用并保留向您追偿一切责任的权利。</p>
                    <p>您承认，本公司有权在您违反上述约定时或本公司收到有权机关的要求或第三方权利人的合法主张后，有权终止向您提供服务并不予退还任何款项，因您上述行为给本公司造成损失的，您应予赔偿。</p>
                </li>
            </ol>
            <h2>五、本公司的权利和义务</h2>
            <ol>
                <li>本公司应根据您选择的服务以及交纳款项的情况向您提供合格的网络技术和信息服务。</li>
                <li>本公司应根据您选择的服务在服务的过程中记录必要的信息，并在您需要的时候或者相关政府监管部门提出监管审查、合规或取证调查时进行提供。</li>
                <li>
                    <p>本公司承诺对您资料采取对外保密措施，不向第三方披露您资料，不授权第三方使用您资料，除非：</p>
                    <ol>
                        <li>(1) 依据本协议条款或者您与本公司之间其他服务协议、合同、在线条款等规定可以提供；</li>
                        <li>(2) 依据法律法规的规定应当提供；</li>
                        <li>(3) 行政、司法等职权部门要求本公司提供；</li>
                        <li>(4) 您同意本公司向第三方提供；</li>
                        <li>(5) 本公司解决举报事件、提起诉讼而提交的；</li>
                        <li>(6) 本公司为防止严重违法行为或涉嫌犯罪行为发生而采取必要合理行动所必须提交的；</li>
                        <li>(7) 本公司为向您提供产品、服务、信息而向第三方提供的，包括本公司通过第三方的技术及服务向您提供产品、服务、信息的情况。</li>
                        <li>(8) 本公司及本公司关联公司所有网站有权使用您的资料和信息。</li>
                    </ol>
                </li>
                <li>本公司有权在当天服务结束后的24小时内按照您当天使用服务的实际情况收取当天的服务费用，并从您的账户(信用卡或者预充值账户)中进行扣除。您应及时关注账户金额(信用卡剩余额度或预充值账户余额)变动情况，若您的账户余额(或者信用卡剩余额度)不足，本公司有权立即暂停或终止向您提供服务，同时您应在被暂停或终止提供服务后的24小时内，将账户金额充值至足以支付上述服务费用的额度，否则您每逾期一日支付的，本公司有权按应付未付费用的千分之三的标准向您收取违约金。</li>
            </ol>
            <h2>六、隐私及其他个人信息的保护</h2>
            <p>一旦您同意本协议或使用本服务，您即同意本公司按照以下条款来使用和披露您的个人信息：</p>
            <ol>
                <li>
                    <h3>账号和密码</h3>
                    <p>在您注册为本公司用户时，我们会要求您设置账号和密码来识别您的身份。您仅可通过您设置的密码来使用该账户，如果您泄漏了密码，您可能会丢失您的个人识别信息，并可能导致对您不利的法律后果。该账号和密码因任何原因受到潜在或现实危险时，您应该立即和本公司取得联系，因账号和密码泄露导致的一切后果，应由您负责承担。</p>
                </li>
                <li>
                    <h3>账号信息</h3>
                    <p>您完成账户注册或激活流程该账户时，应向本公司提供您的真实姓名、地址、国籍、电话号码和电子邮件地址，您还可以选择来填写相关附加信息（包括但不限于您公司所在的省份和城市、时区和邮政编码、传真号码、个人主页和您的职务）。为有针对性地向您提供新的服务和机会，您了解并同意本公司及其关联公司或您登录的其他网站将通过您的电子邮件地址或该手机通知您这些信息。</p>
                </li>
                <li>
                    <h3>银行账户信息</h3>
                    <p>若本公司所提供的服务需要您提供您的银行账户信息，在您提供相应信息后，本公司将严格履行相关保密约定。</p>
                </li>
                <li>
                    <h3>登录记录</h3>
                    <p>为了保障您使用本服务的安全以及不断改进服务质量，本公司将记录并保存您登录和使用本服务的相关信息，但本公司承诺不将此类信息提供给任何第三方（除双方另有约定或法律法规另有规定及本公司关联公司外）。</p>
                </li>
                <li>
                    <h3>广告</h3>
                    <p>本公司会对本公司用户的身份数据进行综合统计，并出于宣传、销售和奖励的需要使用或披露。</p>
                </li>
                <li>
                    <h3>外部链接</h3>
                    <p>本网站含有到其他网站的链接，但本公司对其他网站的隐私保护措施不负任何责任。本公司可能在任何需要的时候增加商业伙伴或共用品牌的网站。</p>
                </li>
                <li>
                    <h3>安全</h3>
                    <p>本公司仅按现有技术提供相应的安全措施来使本公司掌握的信息不丢失，不被滥用和变造。这些安全措施包括向其他服务器备份数据和对用户密码加密。尽管有这些安全措施，但本公司不保证这些信息的绝对安全。</p>
                </li>
            </ol>
            <h2>七、系统中断或故障</h2>
            <p>系统可能因下列状况无法正常运作，使您无法使用各项联网服务时，本公司不承担损害赔偿责任，该状况包括但不限于：</p>
            <ol>
                <li>电信设备出现故障不能进行数据传输的。</li>
                <li>因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成本公司系统障碍不能执行业务的。</li>
                <li>由于黑客攻击、病毒侵入、电信部门技术调整或故障、网站升级、银行支付方面的问题等原因而造成的服务中断或者延迟。</li>
            </ol>
            <h2>八、责任范围及责任限制</h2>
            <ol>
                <li>本公司仅对本条款中列明的责任范围负责。</li>
                <li>本服务之合作单位，所提供之服务品质及内容由该合作单位自行负责，本公司对此不承担任何责任。</li>
                <li>非本公司原因或不可抗力造成的您购买的服务不可用，不属于本公司责任；鉴于互联网的特点，本公司提示：您应自行及时地进行数据备份，对您的数据损失本公司无需承担责任；因您的系统调配或配置不合理或其他您的原因造成的服务不可用不属于本公司责任；本公司对因第三方的作为或不作为而给您或者其他第三方造成的损失不负责任，对通过您间接接受本公司服务的第三方的损失不承担任何责任。</li>
                <li>本公司对于与本协议有关或由本协议引起的任何间接的、惩罚性的、特殊的、派生的损失（包括但不限于业务损失、收益损失、利润损失、使用数据或其他经济利益的损失），不论是如何产生的，也不论是由对本协议的违约（包括违反保证）还是由侵权造成的，均不负有任何责任，即使事先已被告知此等损失的可能性。另外即使本协议规定的排他性救济没有达到其基本目的，也应排除本公司对上述损失的责任。</li>
                <li>如您的网站遭受到来自第三方的网络攻击等黑客行为时，应及时与本公司进行沟通，以保证服务品质，但您仍应支付由此产生的流量或者带宽的费用。</li>
                <li>本公司对本公司提供的服务提供故障监控、自动化恢复等故障管控机制，保障云服务的故障及时处理与恢复。当云服务的节点发生故障时，通过本地的负载均衡和全局的负载均衡进行自动化的切换。当整体云服务发生故障时，本公司将第一时间通知客户按照相应的预案进行处理。</li>
                <li>本公司应使您购买的服务处于可用状态，结合您购买的服务的相关特性，服务可用：指您使用互联网服务的域名下的网页、文件、流媒体等内容可以被访问或被下载；服务不可用:指服务当天总服务时间剔除服务可用时间后,剩余部分时间为服务不可用。</li>
                <li>因本公司自身原因，造成您购买的服务全网不可用的，本公司将以分钟为单位，计算每分钟费用（不足一分钟的按一分钟计算），按实际服务全网不可用时间对应的服务费用减免您相关的服务费用,但减免的最高限额为当天您应付的服务费用且不以任何形式向下一天累计。您同意除本条款前述约定外，因服务不可用本公司不再对您的其他任何损失承担赔偿责任。</li>
                <li>除本协议另有规定外，在任何情况下，您同意本公司对本协议所承担的赔偿范围仅限于直接经济损失且赔偿责任总额不超过向您收取的当天次服务费用总额。</li>
            </ol>
            <h2>九、完整协议</h2>
            <p>本协议由本协议条款与本网站公示的各项规则组成，相关名词可互相引用参照，如有不同理解，以本协议条款为准。</p>
            <p>您对本协议理解和认同，您即对本协议所有组成部分的内容理解并认同，一旦您使用本服务，您和本公司即受本协议所有组成部分的约束。</p>
            <p>本协议若有部分内容被有管辖权的法院认定为无效的，不因此影响其他内容的效力。本协议任一条款未予执行不影响其他条款的效力。</p>
            <h2>十、商标、知识产权的保护</h2>
            <ol>
                <li>除第三方产品或服务外，本网站上所有内容，包括但不限于著作、图片、档案、资讯、资料、架构、页面设计，均由本公司或本公司关联企业依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。</li>
                <li>非经本公司或本公司关联企业书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表本网站上程序或内容。</li>
                <li>尊重知识产权是您应尽的义务，您应自行解决包括但不限于软件版权、应用许可等相关问题，本公司对此无审核义务，我们将您签署本协议行为视为您已经认可前述约定并已经完成了全部的相关工作。如有违反，您应承担损害赔偿责任且本公司保留因此终止本协议的权利。</li>
            </ol>
            <h2>十一、法律适用与争议解决</h2>
            <ol>
                <li>本协议的效力、解释、履行和争议的解决均适用中华人民共和国法律、法规、电信管理部门的规定和计算机行业的规范。</li>
                <li>因履行本协议或与本协议有关的一切争议，应通过友好协商方式解决。如果协商未成，则提交本公司住所地有管辖权的人民法院诉讼解决。</li>
                <li>本公司与您共同确认：本协议签署的选择权对于双方是完全对等而公允的。即任何一方可以不受强制地选择签署或不签署本协议。本协议是经过双方审慎考虑阐述的意思表示，不存在任何一方片面加大另一方责任或逃避应履行义务的情形。任何一方签署或承诺遵守本协议均视为放弃对于本协议公允性的质疑。</li>
            </ol>
            <p>重要声明：如上述合同条款出现中英文表述歧义或内容歧义，均以中文条款为准。</p>
        </div>
    );
}